In [16]:
## python imports
import pandas as pd

In [17]:
path= '../data/userdata1.parquet'
columns = ['id', 'first_name', 'last_name', 'country',]

In [18]:
df = pd.read_parquet(path, columns=columns, engine='pyarrow')

In [19]:
%%time
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          1000 non-null   int32
 1   first_name  1000 non-null   object
 2   last_name   1000 non-null   object
 3   country     1000 non-null   object
dtypes: int32(1), object(3)
memory usage: 27.5+ KB
CPU times: user 13.1 ms, sys: 2.64 ms, total: 15.8 ms
Wall time: 12.7 ms

In [20]:
df.shape

(1000, 4)

In [21]:
df.head()

   id first_name last_name       country
0   1     Amanda    Jordan     Indonesia
1   2     Albert   Freeman        Canada
2   3     Evelyn    Morgan        Russia
3   4     Denise     Riley         China
4   5     Carlos     Burns  South Africa

In [22]:
df.columns

Index(['id', 'first_name', 'last_name', 'country'], dtype='object')

In [23]:
df[:9]

   id first_name last_name                 country
0   1     Amanda    Jordan               Indonesia
1   2     Albert   Freeman                  Canada
2   3     Evelyn    Morgan                  Russia
3   4     Denise     Riley                   China
4   5     Carlos     Burns            South Africa
5   6    Kathryn     White               Indonesia
6   7     Samuel    Holmes                Portugal
7   8      Harry    Howell  Bosnia and Herzegovina
8   9       Jose    Foster             South Korea

In [24]:
df.index

RangeIndex(start=0, stop=1000, step=1)

In [25]:
df.to_parquet

<bound method DataFrame.to_parquet of        id first_name last_name       country
0       1     Amanda    Jordan     Indonesia
1       2     Albert   Freeman        Canada
2       3     Evelyn    Morgan        Russia
3       4     Denise     Riley         China
4       5     Carlos     Burns  South Africa
..    ...        ...       ...           ...
995   996     Dennis    Harris        Greece
996   997     Gloria  Hamilton         China
997   998      Nancy    Morris        Sweden
998   999      Annie   Daniels         China
999  1000      Julie     Meyer         China

[1000 rows x 4 columns]>

df.info()

In [26]:
df.columns

Index(['id', 'first_name', 'last_name', 'country'], dtype='object')

In [27]:
df.dtypes

id             int32
first_name    object
last_name     object
country       object
dtype: object

In [28]:
first_names = df[['first_name', 'id']]

In [29]:
first_names

    first_name    id
0       Amanda     1
1       Albert     2
2       Evelyn     3
3       Denise     4
4       Carlos     5
..         ...   ...
995     Dennis   996
996     Gloria   997
997      Nancy   998
998      Annie   999
999      Julie  1000

[1000 rows x 2 columns]

In [30]:
df.loc[0]

id                    1
first_name       Amanda
last_name        Jordan
country       Indonesia
Name: 0, dtype: object